; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph3 - mode
	image1 - mode
	Star5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star2 - direction
	GroundStation4 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(have_image Star7 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Planet9 thermograph2)
	(have_image Planet10 image1)
	(have_image Star11 spectrograph0)
	(have_image Star12 spectrograph0)
	(have_image Star13 image1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Planet15 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 planet15 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet15)
   goals met: 0 of 9
5. (turn_to satellite0 groundstation0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
6. (take_image satellite1 planet15 instrument1 spectrograph3)
   added: (have_image planet15 spectrograph3)
   goals met: 1 of 9
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
8. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 1 of 9
9. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 9
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
11. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 1 of 9
12. (take_image satellite0 planet9 instrument0 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 2 of 9
13. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 2 of 9
14. (take_image satellite0 star7 instrument0 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 3 of 9
15. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 3 of 9
16. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 4 of 9
17. (turn_to satellite1 groundstation4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation4)
   goals met: 4 of 9
18. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 4 of 9
19. (turn_to satellite1 phenomenon14 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon14)
   goals met: 4 of 9
20. (take_image satellite1 phenomenon14 instrument3 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 5 of 9
21. (turn_to satellite1 planet10 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet10)
   goals met: 5 of 9
22. (take_image satellite1 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 6 of 9
23. (turn_to satellite1 star11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star11)
   goals met: 6 of 9
24. (take_image satellite1 star11 instrument3 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 7 of 9
25. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 7 of 9
26. (take_image satellite1 star12 instrument3 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 8 of 9
27. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 8 of 9
28. (take_image satellite1 star13 instrument3 image1)
   added: (have_image star13 image1)
   goals met: 9 of 9
